Repository: Goldenmonstew/GlossPop
Catalog: Sources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, ru, zh_hans, zh_hant

source: Offline first, AI for missing words
de: Offline zuerst, KI für fehlende Wörter
es: Primero sin conexión; IA para palabras no encontradas
fr: Hors ligne d'abord, IA pour les mots manquants
ja: オフライン優先、見つからない単語はAI
ko: 오프라인 우선, 없는 단어는 AI 사용
ru: Сначала офлайн, ИИ — для отсутствующих слов
zh_hans: 离线优先，查不到的词用 AI
zh_hant: 離線優先，查無單字時用 AI

source: Ollama (local)
de: Ollama (lokal)
ja: Ollama（ローカル）
ko: Ollama(로컬)
ru: Ollama (локально)
zh_hans: Ollama（本地）
zh_hant: Ollama（本機）

source: Open Accessibility Settings
de: Bedienungshilfen-Einstellungen öffnen
es: Abrir ajustes de Accesibilidad
fr: Ouvrir les réglages d'accessibilité
ja: アクセシビリティ設定を開く
ko: 손쉬운 사용 설정 열기
ru: Открыть настройки Универсального доступа
zh_hans: 打开辅助功能设置
zh_hant: 打開「輔助使用」設定

source: Open Dictionary.app
de: Lexikon-App öffnen
es: Abrir la app Diccionario
fr: Ouvrir Dictionnaire
ja: 「辞書」アプリを開く
ko: 사전 앱 열기
ru: Открыть приложение «Словарь»
zh_hans: 打开「词典」App
zh_hant: 打開「辭典」App

source: Open Settings
de: Einstellungen öffnen
es: Abrir Ajustes
fr: Ouvrir les réglages
ja: 設定を開く
ko: 설정 열기
ru: Открыть Настройки
zh_hans: 打开设置
zh_hant: 打開「設定」

source: Paste
de: Einsetzen
es: Pegar
fr: Coller
ja: ペースト
ko: 붙여넣기
ru: Вставить
zh_hans: 粘贴
zh_hant: 貼上

source: Pick a provider and model in Settings (cloud / relay / local Ollama)
de: Wähle Anbieter und Modell in den Einstellungen (Cloud / Relay / lokales Ollama)
es: Elige un proveedor y un modelo en Ajustes (nube / relay / Ollama local)
fr: Choisissez un fournisseur et un modèle dans les Réglages (cloud / relais / Ollama local)
ja: 設定でプロバイダとモデルを選択してください（クラウド / リレー / ローカルOllama）
ko: 설정에서 제공업체와 모델을 선택하세요(클라우드/릴레이/로컬 Ollama)
ru: Выберите провайдера и модель в Настройках (облако / релей / локальная Ollama)
zh_hans: 在设置中选择服务商和模型（云 / 中转 / 本地 Ollama）
zh_hant: 請在「設定」中選擇服務供應商與模型（雲端／中繼／本機 Ollama）

source: Press a hotkey… Esc cancels
de: Drücke einen Tastaturkurzbefehl… Esc bricht ab
es: Pulsa un atajo… Esc cancela
fr: Appuyez sur un raccourci… Échap annule
ja: ホットキーを押してください… Escでキャンセル
ko: 단축키를 누르세요… Esc로 취소
ru: Нажмите сочетание клавиш… Esc — отмена
zh_hans: 按下快捷键… Esc 取消
zh_hant: 請按下快速鍵… 按 Esc 取消

source: Provider
de: Anbieter
es: Proveedor
fr: Fournisseur
ja: プロバイダ
ko: 제공업체
ru: Провайдер
zh_hans: 服务商
zh_hant: 服務供應商

source: Querying the AI dictionary…
de: KI-Lexikon wird abgefragt…
es: Consultando el diccionario de IA…
fr: Interrogation du dictionnaire IA…
ja: AI辞書に問い合わせ中…
ko: AI 사전 조회 중…
ru: Запрос к ИИ-словарю…
zh_hans: 正在查询 AI 词典…
zh_hant: 正在查詢 AI 辭典…

source: Quit GlossPop
de: GlossPop beenden
es: Salir de GlossPop
fr: Quitter GlossPop
ja: GlossPopを終了
ko: GlossPop 종료
ru: Завершить GlossPop
zh_hans: 退出 GlossPop
zh_hant: 結束 GlossPop

source: Reasoning effort
de: Reasoning-Aufwand
es: Esfuerzo de razonamiento
fr: Effort de raisonnement
ja: 推論の強度
ko: 추론 강도
ru: Уровень рассуждений
zh_hans: 推理强度
zh_hant: 推理強度

source: Recent Translations
de: Letzte Übersetzungen
es: Traducciones recientes
fr: Traductions récentes
ja: 最近の翻訳
ko: 최근 번역
ru: Недавние переводы
zh_hans: 最近翻译
zh_hant: 最近的翻譯

source: Redo
de: Wiederholen
es: Rehacer
fr: Rétablir
ja: やり直す
ko: 실행 복귀
ru: Повторить
zh_hans: 重做
zh_hant: 重做

source: Result cards drop the “System dictionary / AI · cloud / on-device” hints; errors and buttons still show.
de: Ergebniskarten lassen die Hinweise „Systemlexikon / KI · Cloud / auf dem Gerät“ weg; Fehler und Tasten werden weiterhin angezeigt.
es: Las tarjetas de resultados omiten las indicaciones “Diccionario del sistema / IA · nube / en el dispositivo”; los errores y los botones se siguen mostrando.
fr: Les cartes de résultat omettent les mentions « Dictionnaire système / IA · cloud / sur l'appareil » ; les erreurs et les boutons restent affichés.
ja: 結果カードでは「システム辞書 / AI · クラウド / オンデバイス」のヒントを省略します。エラーとボタンは引き続き表示されます。
ko: 결과 카드에서 “시스템 사전 / AI · 클라우드 / 온디바이스” 힌트가 사라지며, 오류와 버튼은 계속 표시됩니다.
ru: В карточках результатов не показываются подсказки «Системный словарь / ИИ · облако / на устройстве»; ошибки и кнопки остаются.
zh_hans: 结果卡片不再显示「系统词典 / AI · 云 / 本机」提示行；错误和按钮仍会显示。
zh_hant: 結果卡片不再顯示「系統辭典／AI · 雲端／裝置端」等提示；錯誤訊息與按鈕仍會顯示。

source: Second language (study / AI definition language)
de: Zweitsprache (Lernsprache / Sprache der KI-Definitionen)
es: Segundo idioma (estudio / idioma de las definiciones de IA)
fr: Deuxième langue (étude / langue des définitions IA)
ja: 第二言語（学習言語 / AI定義の言語）
ko: 제2언어(학습 언어/AI 정의 언어)
ru: Второй язык (изучаемый / язык определений ИИ)
zh_hans: 第二语言（学习语言 / AI 释义语言）
zh_hant: 第二語言（學習／AI 釋義語言）

source: Select All
de: Alles auswählen
es: Seleccionar todo
fr: Tout sélectionner
ja: すべてを選択
ko: 전부 선택
ru: Выбрать все
zh_hans: 全选
zh_hant: 全選

source: Select some text, then press %@
de: Wähle Text aus und drücke dann %@
es: Selecciona texto y luego pulsa %@
fr: Sélectionnez du texte, puis appuyez sur %@
ja: テキストを選択してから %@ を押してください
ko: 텍스트를 선택한 다음 %@을(를) 누르세요
ru: Выделите текст и нажмите %@
zh_hans: 先选中一段文本，再按 %@
zh_hant: 請先選取文字，再按 %@

source: Sentences → translation + syntax analysis
de: Sätze → Übersetzung + Syntaxanalyse
es: Frases → traducción + análisis sintáctico
fr: Phrases → traduction + analyse syntaxique
ja: 文 → 翻訳 + 構文解析
ko: 문장 → 번역 + 구문 분석
ru: Предложения → перевод + синтаксический анализ
zh_hans: 句子 → 翻译 + 句法分析
zh_hant: 句子 → 翻譯 + 語法分析

source: Settings…
de: Einstellungen…
es: Ajustes…
fr: Réglages…
ja: 設定…
ko: 설정…
ru: Настройки…
zh_hans: 设置…
zh_hant: 設定…

source: Skip the system dictionary — words/phrases go straight to the AI dictionary: definition in your second language, meaning in your first.
de: Systemlexikon überspringen – Wörter/Phrasen gehen direkt ans KI-Lexikon: Definition in deiner Zweitsprache, Bedeutung in deiner Erstsprache.
es: Omite el diccionario del sistema: las palabras y frases van directas al diccionario de IA, con definición en tu segundo idioma y significado en el primero.
fr: Ignore le dictionnaire système — les mots et expressions vont directement au dictionnaire IA : définition dans votre deuxième langue, sens dans votre première.
ja: システム辞書をスキップ — 単語/フレーズを直接AI辞書で調べます。第二言語での定義と第一言語での意味を表示します。
ko: 시스템 사전을 건너뛰고 단어/구를 바로 AI 사전으로 보냅니다. 정의는 제2언어로, 뜻은 제1언어로 제공됩니다.
ru: Минуя системный словарь: слова и фразы идут сразу в ИИ-словарь — определение на втором языке, значение на первом.
zh_hans: 跳过系统词典——单词/短语直接查 AI 词典：第二语言释义，第一语言含义。
zh_hant: 略過系統辭典——單字／片語直接送往 AI 辭典：以第二語言給出定義，再以第一語言說明意思。

source: Stored only in your local Keychain
de: Wird nur in deinem lokalen Schlüsselbund gespeichert
es: Se guarda solo en tu llavero local
fr: Stockée uniquement dans votre trousseau local
ja: ローカルのキーチェーンにのみ保存されます
ko: 로컬 키체인에만 저장됩니다
ru: Хранится только в локальной Связке ключей
zh_hans: 仅存储在本机钥匙串中
zh_hant: 僅儲存在你本機的鑰匙圈中

source: System Settings ▸ Privacy & Security ▸ Accessibility
de: Systemeinstellungen ▸ Datenschutz & Sicherheit ▸ Bedienungshilfen
es: Ajustes del Sistema ▸ Privacidad y seguridad ▸ Accesibilidad
fr: Réglages Système ▸ Confidentialité et sécurité ▸ Accessibilité
ja: システム設定 ▸ プライバシーとセキュリティ ▸ アクセシビリティ
ko: 시스템 설정 ▸ 개인정보 보호 및 보안 ▸ 손쉬운 사용
ru: Системные настройки ▸ Конфиденциальность и безопасность ▸ Универсальный доступ
zh_hans: 系统设置 ▸ 隐私与安全性 ▸ 辅助功能
zh_hant: 系統設定 ▸ 隱私權與安全性 ▸ 輔助使用

source: System dictionary · offline
de: Systemlexikon · offline
es: Diccionario del sistema · sin conexión
fr: Dictionnaire système · hors ligne
ja: システム辞書 · オフライン
ko: 시스템 사전 · 오프라인
ru: Системный словарь · офлайн
zh_hans: 系统词典 · 离线
zh_hant: 系統辭典 · 離線

source: System dictionary · offline · add dictionaries in Dictionary.app for your language
de: Systemlexikon · offline · füge in der Lexikon-App Wörterbücher für deine Sprache hinzu
es: Diccionario del sistema · sin conexión · añade diccionarios para tu idioma en la app Diccionario
fr: Dictionnaire système · hors ligne · ajoutez des dictionnaires pour votre langue dans Dictionnaire
ja: システム辞書 · オフライン · 「辞書」アプリでお使いの言語の辞書を追加してください
ko: 시스템 사전 · 오프라인 · 사전 앱에서 해당 언어의 사전을 추가하세요
ru: Системный словарь · офлайн · добавьте словари для вашего языка в приложении «Словарь»
zh_hans: 系统词典 · 离线 · 请在「词典」App 中添加你语言的词典
zh_hant: 系統辭典 · 離線 · 請在「辭典」App 中加入適合你語言的辭典

source: System dictionary · offline · entries follow your Dictionary.app setup
de: Systemlexikon · offline · Einträge richten sich nach deiner Lexikon-App-Konfiguration
es: Diccionario del sistema · sin conexión · las entradas siguen tu configuración de la app Diccionario
fr: Dictionnaire système · hors ligne · les entrées suivent votre configuration de Dictionnaire
ja: システム辞書 · オフライン · 項目は「辞書」アプリの設定に従います
ko: 시스템 사전 · 오프라인 · 항목은 사전 앱 설정을 따릅니다
ru: Системный словарь · офлайн · статьи соответствуют настройкам приложения «Словарь»
zh_hans: 系统词典 · 离线 · 词条跟随你的「词典」App 设置
zh_hant: 系統辭典 · 離線 · 條目依照你在「辭典」App 中的設定

source: System dictionary · offline · querying the AI dictionary…
de: Systemlexikon · offline · KI-Lexikon wird abgefragt…
es: Diccionario del sistema · sin conexión · consultando el diccionario de IA…
fr: Dictionnaire système · hors ligne · interrogation du dictionnaire IA…
ja: システム辞書 · オフライン · AI辞書に問い合わせ中…
ko: 시스템 사전 · 오프라인 · AI 사전 조회 중…
ru: Системный словарь · офлайн · запрос к ИИ-словарю…
zh_hans: 系统词典 · 离线 · 正在查询 AI 词典…
zh_hant: 系統辭典 · 離線 · 正在查詢 AI 辭典…

source: Test connection
de: Verbindung testen
es: Probar conexión
fr: Tester la connexion
ja: 接続テスト
ko: 연결 테스트
ru: Проверить подключение
zh_hans: 测试连接
zh_hant: 測試連線

source: That hotkey is taken — keeping the previous one
de: Dieser Tastaturkurzbefehl ist bereits belegt – der vorherige bleibt erhalten
es: Ese atajo ya está en uso: se mantiene el anterior
fr: Ce raccourci est déjà utilisé — l'ancien est conservé
ja: そのホットキーは既に使用されています — 以前の設定を維持します
ko: 이미 사용 중인 단축키입니다 — 이전 단축키를 유지합니다
ru: Это сочетание занято — оставлено прежнее
zh_hans: 该快捷键已被占用——保留之前的快捷键
zh_hant: 該快速鍵已被佔用——保留先前的設定

source: The hotkey needs ⌃ or ⌥
de: Der Tastaturkurzbefehl benötigt ⌃ oder ⌥
es: El atajo debe incluir ⌃ u ⌥
fr: Le raccourci doit inclure ⌃ ou ⌥
ja: ホットキーには ⌃ または ⌥ が必要です
ko: 단축키에는 ⌃ 또는 ⌥가 필요합니다
ru: Сочетание должно включать ⌃ или ⌥
zh_hans: 快捷键需包含 ⌃ 或 ⌥
zh_hant: 快速鍵需要包含 ⌃ 或 ⌥

source: The selection can't be read here.
de: Die Auswahl kann hier nicht gelesen werden.
es: Aquí no se puede leer la selección.
fr: La sélection ne peut pas être lue ici.
ja: ここでは選択テキストを読み取れません。
ko: 여기에서는 선택한 텍스트를 읽을 수 없습니다.
ru: Здесь не удаётся прочитать выделенный текст.
zh_hans: 无法读取此处的选中内容。
zh_hant: 無法在此處讀取選取內容。

source: The system dictionary follows whatever you enable in Dictionary.app; the AI dictionary always gives a second-language definition plus a first-language meaning.
de: Das Systemlexikon richtet sich nach dem, was du in der Lexikon-App aktivierst; das KI-Lexikon liefert immer eine Definition in der Zweitsprache plus eine Bedeutung in der Erstsprache.
es: El diccionario del sistema sigue lo que actives en la app Diccionario; el diccionario de IA siempre da una definición en el segundo idioma más un significado en el primero.
fr: Le dictionnaire système suit ce que vous activez dans Dictionnaire ; le dictionnaire IA fournit toujours une définition en deuxième langue et le sens en première langue.
ja: システム辞書は「辞書」アプリで有効にした内容に従います。AI辞書は常に第二言語の定義と第一言語の意味を表示します。
ko: 시스템 사전은 사전 앱에서 활성화한 항목을 따르며, AI 사전은 항상 제2언어 정의와 제1언어 뜻을 함께 제공합니다.
ru: Системный словарь использует то, что включено в приложении «Словарь»; ИИ-словарь всегда даёт определение на втором языке и значение на первом.
zh_hans: 系统词典遵循你在「词典」App 中启用的词典；AI 词典始终给出第二语言释义加第一语言含义。
zh_hant: 系統辭典依照你在「辭典」App 中啟用的內容；AI 辭典一律提供第二語言定義，加上第一語言意思。

source: This app doesn't expose its selection — turn on the copy fallback in Settings
de: Diese App gibt ihre Auswahl nicht frei – aktiviere den Kopier-Fallback in den Einstellungen
es: Esta app no expone su selección: activa la alternativa de copiado en Ajustes
fr: Cette app n'expose pas sa sélection — activez la copie de secours dans les Réglages
ja: このアプリは選択テキストを公開していません — 設定でコピーフォールバックをオンにしてください
ko: 이 앱은 선택 텍스트를 제공하지 않습니다 — 설정에서 복사 대체 기능을 켜세요
ru: Это приложение не раскрывает выделенный текст — включите резервное копирование в Настройках
zh_hans: 该 App 不公开其选中内容——请在设置中开启复制兜底
zh_hant: 此 App 不公開其選取內容——請在「設定」中開啟拷貝後備方案

source: This mode needs an AI model — none is configured under “Translation model” above.
de: Dieser Modus benötigt ein KI-Modell – unter „Übersetzungsmodell“ oben ist keines konfiguriert.
es: Este modo necesita un modelo de IA: no hay ninguno configurado en “Modelo de traducción” más arriba.
fr: Ce mode nécessite un modèle d'IA — aucun n'est configuré sous « Modèle de traduction » ci-dessus.
ja: このモードにはAIモデルが必要です — 上の「翻訳モデル」で設定されていません。
ko: 이 모드에는 AI 모델이 필요합니다 — 위의 “번역 모델”에 설정된 모델이 없습니다.
ru: Этому режиму нужна модель ИИ — она не настроена в разделе «Модель перевода» выше.
zh_hans: 此模式需要 AI 模型——上方「翻译模型」尚未配置。
zh_hant: 此模式需要 AI 模型——上方「翻譯模型」尚未設定任何模型。

source: Translate Selection
de: Auswahl übersetzen
es: Traducir selección
fr: Traduire la sélection
ja: 選択テキストを翻訳
ko: 선택 항목 번역
ru: Перевести выделенное
zh_hans: 翻译选区
zh_hant: 翻譯選取內容

source: Translate Selection (%@ failed to register · click here)
de: Auswahl übersetzen (%@ konnte nicht registriert werden · hier klicken)
es: Traducir selección (no se pudo registrar %@ · haz clic aquí)
fr: Traduire la sélection (échec de l'enregistrement de %@ · cliquez ici)
ja: 選択テキストを翻訳（%@ の登録に失敗 · ここをクリック）
ko: 선택 항목 번역(%@ 등록 실패 · 여기를 클릭)
ru: Перевести выделенное (%@ не зарегистрировано · нажмите здесь)
zh_hans: 翻译选区（%@ 注册失败 · 点这里）
zh_hant: 翻譯選取內容（%@ 註冊失敗 · 請按這裡）

source: Translate Selection (%@)
de: Auswahl übersetzen (%@)
es: Traducir selección (%@)
fr: Traduire la sélection (%@)
ja: 選択テキストを翻訳（%@）
ko: 선택 항목 번역(%@)
ru: Перевести выделенное (%@)
zh_hans: 翻译选区（%@）
zh_hant: 翻譯選取內容（%@）

source: Translates into your first language; text already in it goes to the second. AI dictionary: second-language definition + first-language meaning.
de: Übersetzt in deine Erstsprache; Text, der bereits darin vorliegt, wird in die Zweitsprache übersetzt. KI-Lexikon: Definition in der Zweitsprache + Bedeutung in der Erstsprache.
es: Traduce a tu primer idioma; el texto que ya está en él pasa al segundo. Diccionario de IA: definición en el segundo idioma + significado en el primero.
fr: Traduit vers votre première langue ; un texte déjà dans celle-ci passe à la deuxième. Dictionnaire IA : définition en deuxième langue + sens en première langue.
ja: 第一言語に翻訳します。すでに第一言語のテキストは第二言語へ翻訳します。AI辞書：第二言語の定義 + 第一言語の意味。
ko: 제1언어로 번역하며, 이미 제1언어인 텍스트는 제2언어로 번역됩니다. AI 사전: 제2언어 정의 + 제1언어 뜻.
ru: Перевод выполняется на первый язык; текст уже на нём переводится на второй. ИИ-словарь: определение на втором языке + значение на первом.
zh_hans: 译成你的第一语言；本身已是第一语言的文本则译成第二语言。AI 词典：第二语言释义 + 第一语言含义。
zh_hant: 翻譯成你的第一語言；已是第一語言的文字則翻成第二語言。AI 辭典：第二語言定義 + 第一語言意思。

source: Translating…
de: Wird übersetzt…
es: Traduciendo…
fr: Traduction…
ja: 翻訳中…
ko: 번역 중…
ru: Перевод…
zh_hans: 翻译中…
zh_hant: 翻譯中…

source: Translation failed (%@%@) · %@
de: Übersetzung fehlgeschlagen (%@%@) · %@
es: Error de traducción (%@%@) · %@
fr: Échec de la traduction (%@%@) · %@
ja: 翻訳に失敗しました（%@%@） · %@
ko: 번역 실패(%@%@) · %@
ru: Не удалось перевести (%@%@) · %@
zh_hans: 翻译失败（%@%@）· %@
zh_hant: 翻譯失敗（%@%@） · %@

source: Translation failed (%@%@) · empty model response
de: Übersetzung fehlgeschlagen (%@%@) · leere Modellantwort
es: Error de traducción (%@%@) · respuesta del modelo vacía
fr: Échec de la traduction (%@%@) · réponse du modèle vide
ja: 翻訳に失敗しました（%@%@） · モデルの応答が空です
ko: 번역 실패(%@%@) · 모델 응답이 비어 있음
ru: Не удалось перевести (%@%@) · пустой ответ модели
zh_hans: 翻译失败（%@%@）· 模型返回为空
zh_hant: 翻譯失敗（%@%@） · 模型回應為空

source: Translation hotkey
de: Tastaturkurzbefehl zum Übersetzen
es: Atajo de traducción
fr: Raccourci de traduction
ja: 翻訳ホットキー
ko: 번역 단축키
ru: Сочетание клавиш для перевода
zh_hans: 翻译快捷键
zh_hant: 翻譯快速鍵

source: Translation interrupted (%@%@) · %@
de: Übersetzung unterbrochen (%@%@) · %@
es: Traducción interrumpida (%@%@) · %@
fr: Traduction interrompue (%@%@) · %@
ja: 翻訳が中断されました（%@%@） · %@
ko: 번역 중단됨(%@%@) · %@
ru: Перевод прерван (%@%@) · %@
zh_hans: 翻译中断（%@%@）· %@
zh_hant: 翻譯中斷（%@%@） · %@

source: Translation model
de: Übersetzungsmodell
es: Modelo de traducción
fr: Modèle de traduction
ja: 翻訳モデル
ko: 번역 모델
ru: Модель перевода
zh_hans: 翻译模型
zh_hant: 翻譯模型

source: Undo
de: Widerrufen
es: Deshacer
fr: Annuler
ja: 取り消す
ko: 실행 취소
ru: Отменить
zh_hans: 撤销
zh_hant: 還原

source: User
de: Benutzer
es: Usuario
fr: Utilisateur
ja: ユーザ
ko: 사용자
ru: Пользовательский
zh_hans: 用户
zh_hant: 使用者

source: Variables: $text (the selection), $target (target language). Plain translation only — dictionary/syntax keep the built-in prompts.
de: Variablen: $text (die Auswahl), $target (Zielsprache). Nur einfache Übersetzung – Lexikon/Syntax behalten die integrierten Prompts.
es: Variables: $text (la selección), $target (idioma de destino). Solo traducción simple: el diccionario y la sintaxis mantienen los prompts integrados.
fr: Variables : $text (la sélection), $target (langue cible). Traduction simple uniquement — le dictionnaire et la syntaxe conservent les prompts intégrés.
ja: 変数: $text（選択テキスト）、$target（翻訳先言語）。プレーン翻訳のみに適用 — 辞書/構文解析は内蔵プロンプトを使用します。
ko: 변수: $text(선택한 텍스트), $target(대상 언어). 일반 번역에만 적용되며, 사전/구문 분석은 내장 프롬프트를 사용합니다.
ru: Переменные: $text (выделенный текст), $target (язык перевода). Только обычный перевод — словарь и синтаксис используют встроенные промпты.
zh_hans: 变量：$text（选中文本）、$target（目标语言）。仅用于普通翻译——词典/句法仍使用内置提示词。
zh_hant: 變數：$text（選取的文字）、$target（目標語言）。僅套用於純翻譯——辭典／語法分析仍使用內建提示詞。

source: Window
de: Fenster
es: Ventana
fr: Fenêtre
ja: ウインドウ
ko: 윈도우
ru: Окно
zh_hans: 窗口
zh_hant: 視窗

source: e.g. gpt-4o-mini
de: z. B. gpt-4o-mini
es: p. ej., gpt-4o-mini
fr: p. ex. gpt-4o-mini
ja: 例: gpt-4o-mini
ko: 예: gpt-4o-mini
ru: например, gpt-4o-mini
zh_hans: 如 gpt-4o-mini
zh_hant: 例如 gpt-4o-mini

source: macOS system dictionary only (offline, instant). A miss shows an “Explain with AI” button — nothing is ever sent automatically. Sentences still use your translation model.
de: Nur das macOS-Systemlexikon (offline, sofort). Wird nichts gefunden, erscheint die Taste „Mit KI erklären“ – es wird nie etwas automatisch gesendet. Sätze verwenden weiterhin dein Übersetzungsmodell.
es: Solo el diccionario del sistema de macOS (sin conexión, instantáneo). Si no se encuentra la palabra, aparece el botón “Explicar con IA”: nunca se envía nada automáticamente. Las frases siguen usando tu modelo de traducción.
fr: Dictionnaire système macOS uniquement (hors ligne, instantané). En cas d'absence, un bouton « Expliquer avec l'IA » s'affiche — rien n'est jamais envoyé automatiquement. Les phrases utilisent toujours votre modèle de traduction.
ja: macOSのシステム辞書のみ（オフライン・即時）。見つからない場合は「AIで説明」ボタンが表示されます — 自動的に送信されることは一切ありません。文には引き続き翻訳モデルを使用します。
ko: macOS 시스템 사전만 사용합니다(오프라인, 즉시). 결과가 없으면 “AI로 설명” 버튼이 표시되며, 어떤 것도 자동으로 전송되지 않습니다. 문장은 여전히 번역 모델을 사용합니다.
ru: Только системный словарь macOS (офлайн, мгновенно). Если слова нет, появится кнопка «Объяснить с помощью ИИ» — ничего не отправляется автоматически. Предложения по-прежнему переводит ваша модель.
zh_hans: 仅使用 macOS 系统词典（离线、即时）。查不到时显示「用 AI 解释一次」按钮——绝不会自动发送任何内容。句子仍使用你的翻译模型。
zh_hant: 僅使用 macOS 系統辭典（離線、即時）。查無結果時會顯示「用 AI 解釋」按鈕——絕不會自動傳送任何內容。句子仍會使用你的翻譯模型。

source: v%@ · Selection translator
de: v%@ · Auswahlübersetzer
es: v%@ · Traductor de selección
fr: v%@ · Traducteur de sélection
ja: v%@ · 選択テキスト翻訳
ko: v%@ · 선택 텍스트 번역기
ru: v%@ · Перевод выделенного текста
zh_hans: v%@ · 划词翻译
zh_hant: v%@ · 選取翻譯工具

source: “%@” isn't in the system dictionary.
de: „%@“ ist nicht im Systemlexikon.
es: “%@” no está en el diccionario del sistema.
fr: « %@ » ne figure pas dans le dictionnaire système.
ja: 「%@」はシステム辞書にありません。
ko: “%@”은(는) 시스템 사전에 없습니다.
ru: «%@» нет в системном словаре.
zh_hans: 系统词典里查不到「%@」。
zh_hant: 系統辭典中查無「%@」。

source: · cloud
es: · nube
ja: · クラウド
ko: · 클라우드
ru: · облако
zh_hans: · 云
zh_hant: · 雲端

source: International
es: Internacional
ja: 国際
ko: 글로벌
ru: Международные
zh_hans: 国际
zh_hant: 國際

source: Minimal
es: Mínimo
ja: 最小
ko: 최소
ru: Минимальный
zh_hans: 最低
zh_hant: 最低

source: System
es: Sistema
fr: Système
ja: システム
ko: 시스템
ru: Системный
zh_hans: 系统
zh_hant: 系統

source: O:
ja: 目的語:
ko: 목적어:
ru: Д:
zh_hans: 宾：
zh_hant: 受詞：

source: S: %@ V: %@%@
ja: 主語: %@ 述語: %@%@
ko: 주어: %@ 서술어: %@%@
ru: П: %@ С: %@%@
zh_hans: 主：%@ 谓：%@%@
zh_hant: 主詞：%@ 動詞：%@%@
